Outline Property
 The bounds of the view in paper space (in feet).
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
 Syntax
  C#
public BoundingBoxUV Outline { get; }
  Visual Basic
Public ReadOnly Property Outline As BoundingBoxUV
	Get
  Visual C++
public:
property BoundingBoxUV^ Outline {
	BoundingBoxUV^ get ();
}
 Remarks
 Returns all zeros for empty views.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →